Revit 2027 API
Railing.RemoveHost Method
 Removes the association between the railing and its host.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveHost()
Public Sub RemoveHost
public:
void RemoveHost()
member RemoveHost : unit -> unit
See Also
Reference
Railing Class
Autodesk.Revit.DB.Architecture Namespace